/*
zadatak2.js - Продавница
Направити променљиву која представља цену производа коју купац жели да купи
Направити променљиву која представља количину новца коју купац има
Ако купац нема довољно новца, исписати поруку: "Немате довољно новца", а затим написати тренутно стање (остаје исто)
Ако има довољно новца, исписати: "Успешно сте купили производ", а затим исписати тренутно стање (сада измењено)*/

let price = 10;
let money = 100;
let change = money - price;

if(price > money) {
    console.log(`You don't have enough money. You have only ${money}$.`);
} else {
    console.log(`You buy this product, in your wallet now is ${change}$.`);
}